In [4]:
import numpy as np
import pandas as pd

In [24]:
# f1=pd.ExcelFile('Day1_register.xlsx')
df1=pd.read_excel('Day1_register.xlsx','Sheet1')
df2=pd.read_excel('Day2_register.xlsx','Sheet1')
name1=np.array(df1['Name'])
name2=np.array(df2['Name'])
print(len(np.union1d(name1,name2)))

20

In [25]:
df1.merge(df2,on='Name',how='inner')['Name']

0    Christine
1        Susan
2       Judith
3         Mary
4    Elizabeth
5     Patricia
6      Barbara
7      Lynette
8        Robyn
9        Karen
Name: Name, dtype: object

In [29]:
either=df1.merge(df2,on='Name',how='outer')['Name']
either

0     Christine
1         Susan
2      Margaret
3        Judith
4      Jennifer
5          Mary
6     Elizabeth
7      Patricia
8         Linda
9       Barbara
10      Lynette
11        Robyn
12         Anne
13        Karen
14        Helen
15       Sandra
16        Wendy
17        Janet
18      Heather
19        Diane
Name: Name, dtype: object

In [30]:
either.count()

20

In [33]:
df3=df1.merge(df2,how='outer',on=['Name','Duration'])
df3.fillna(value='-')

         Name Time of Joining_x  Duration Time of Joining_y
0   Christine          11:00:00        40          11:00:00
1       Susan          11:04:00        30          11:06:00
2    Margaret          11:08:00        30                 -
3      Judith          11:01:00        40          11:09:00
4    Jennifer          11:12:00        50                 -
5        Mary          11:10:00        30                 -
6   Elizabeth          11:11:00        30          11:08:00
7    Patricia          11:07:00        40          11:08:00
8       Linda          11:08:00        50                 -
9     Barbara          11:15:00        30          11:14:00
10    Lynette          11:02:00        40          11:10:00
11      Robyn          11:03:00        30          11:00:00
12       Anne          11:19:00        30                 -
13      Karen          11:13:00        40          11:09:00
14      Helen          11:05:00        50                 -
15       Mary                 -        50          11:10:00
16     Sandra                 -        30          11:12:00
17      Wendy                 -        40          11:13:00
18      Janet                 -        50          11:02:00
19    Heather                 -        30          11:08:00
20      Diane                 -        30          11:06:00